{
    "original_dialogue": [
        {
            "patient": "Recently, I am experiencing Acid reflux, Doctor: ?",
            "doctor": "Oh, do you have any Stomach ache?"
        },
        {
            "patient": "Not that I know of, Doctor: ?",
            "doctor": "Is it? Then do you experience Bloating?"
        },
        {
            "patient": "Not that I know of, Doctor: ?",
            "doctor": "What about Pain behind the breastbone?"
        },
        {
            "patient": "Yes, sometimes, Doctor: ?",
            "doctor": "In that case, you have Esophagitis."
        }
    ],
    "gpt3_output_with_improvement": [
        {
            "patient": "Recently, I am experiencing Acid reflux.",
            "doctor": "Let's think step by step. You are experiencing acid reflux. But do you have pain behind the breastbone?"
        },

        {
            "patient": "Yes Doctor, I am feeling that sometimes.",
            "doctor": "Let's think step by step. You are experiencing acid reflux and pain behind the breastbone. Are you feeling any bloating or stomach ache?"
        },

        {
            "patient": "No, not that I know of doctor.",
            "doctor": "Are you having any trouble swallowing?"
        },


        {
            "patient": "Yes, I am having some trouble swallowing.",
            "doctor": "Based on the symptoms that you are having, it is likely that you have gastroesophageal reflux disease (GERD). I recommend that you see a specialist and get a confirmatory test done to be sure."
        }
    ],
    "issue": "GPT3 is inconsistent. It does not ask further questions. But it did recommend a few suggestions to overcome this problem. Despite doing that, it did ask to go check with a doctor after giving diagnosis and suggestions as a doctor ",
    "improvement": "GPT3 handles multiple symptoms in a single sentence and processes each one of them to go ahead and give a diagnosis. It even came up with asking the patient a new symptom on its own. But the final diagnosis was GERD and not Esophagitis."

}